In [67]:
import pandas as pd

In [68]:
population = pd.Series([9668465,3391946,2942828,1450062],
                       index = ['서울','부산','인천','광주'])
population

서울    9668465
부산    3391946
인천    2942828
광주    1450062
dtype: int64

In [69]:
print(population.index)
print(population.dtype)
population.values

Index(['서울', '부산', '인천', '광주'], dtype='object')
int64

array([9668465, 3391946, 2942828, 1450062], dtype=int64)

In [70]:
population.name = '인구'
population.index.name = '도시'
population

도시
서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 인구, dtype: int64

In [71]:
population/10000

도시
서울    966.8465
부산    339.1946
인천    294.2828
광주    145.0062
Name: 인구, dtype: float64

In [72]:
population[1],population['부산']

(3391946, 3391946)

In [73]:
population[[0,3,1]]

도시
서울    9668465
광주    1450062
부산    3391946
Name: 인구, dtype: int64

In [74]:
population[['서울','광주','부산']]

도시
서울    9668465
광주    1450062
부산    3391946
Name: 인구, dtype: int64

In [75]:
population > 2000000

도시
서울     True
부산     True
인천     True
광주    False
Name: 인구, dtype: bool

In [76]:
population[population > 2000000]

도시
서울    9668465
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [77]:
print(population[population >= 3000000])
print(population[(population <= 5000000) & (population >= 2500000)])

도시
서울    9668465
부산    3391946
Name: 인구, dtype: int64
도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [78]:
population[1:3]

도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [79]:
population['부산':'인천']

도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [80]:
data = {'피카츄' : 9631, '꼬부기' : 3393, '파이리' : 1490, '이상해씨' : 2632}
pokemon = pd.Series(data)
pokemon

피카츄     9631
꼬부기     3393
파이리     1490
이상해씨    2632
dtype: int64

In [81]:
data2 = {'피카츄' : 9904, '꼬부기' : 3448, '이브이' : 2466, '뮤' : 2890}
pokemon_up = pd.Series(data2)
pokemon_up

피카츄    9904
꼬부기    3448
이브이    2466
뮤      2890
dtype: int64

In [82]:
attack = pokemon_up - pokemon
attack.notnull()

꼬부기      True
뮤       False
이브이     False
이상해씨    False
파이리     False
피카츄      True
dtype: bool

In [83]:
print(attack[attack.notnull()])
attack.dropna()

꼬부기     55.0
피카츄    273.0
dtype: float64

꼬부기     55.0
피카츄    273.0
dtype: float64

In [84]:
rp = ((pokemon_up - pokemon) / pokemon) *100
rp.dropna()

꼬부기    1.620984
피카츄    2.834597
dtype: float64

In [85]:
print(attack)
attack['파이리'] = 1616
attack['리자몽'] = 8888
del attack['이상해씨']
attack

꼬부기      55.0
뮤         NaN
이브이       NaN
이상해씨      NaN
파이리       NaN
피카츄     273.0
dtype: float64

꼬부기      55.0
뮤         NaN
이브이       NaN
파이리    1616.0
피카츄     273.0
리자몽    8888.0
dtype: float64

In [86]:
print(attack.isnull())
attack[attack.isnull()]

꼬부기    False
뮤       True
이브이     True
파이리    False
피카츄    False
리자몽    False
dtype: bool

뮤     NaN
이브이   NaN
dtype: float64

In [87]:
data = {'2020' : [9668465, 3391946, 2942828, 1450062],
        '2010' : [10312545, 3567910, 2758296, 1454636]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
# df.index = ['서울','부산','인천','광주']
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [88]:
# 인덱스 지정 DafaFrame 생성
data2 = [[9668465, 3391946, 2942828, 1450062],
         [10312545, 3567910, 2758296, 1454636]]
ind = ['2020', '2010']
col = ['서울','부산','인천','광주']
df2 = pd.DataFrame(data2, index= ind, columns = col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

In [89]:
print(df.values, df.index, df.columns)

[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]] Index(['서울', '부산', '인천', '광주'], dtype='object') Index(['2020', '2010'], dtype='object')

In [90]:
df['2020'] # 열 인덱싱

서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 2020, dtype: int64

In [91]:
df[['2020']]

       2020
서울  9668465
부산  3391946
인천  2942828
광주  1450062

In [92]:
df[['2020','2010']]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [93]:
df['2005'] = [9762546, 3512547, 2517680, 1456016]
df

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  1456016

In [94]:
df[0:2] # 행 슬라이싱

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [95]:
df['서울':'부산']

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [101]:
# loc[] 인덱서 인덱스 이름을 사용하여 행을 가져옴
df.loc['부산':'인천','2020':'2010']

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

In [ ]:
# iloc[] 인덱서 
df.iloc[]